/// file: validate.ar.ts
const locale: import("./validate.locale").ValidateLocale = {
  "required": "هذا الحقل مطلوب",

  "number": "يجب أن يكون هذا الحقل رقمًا صالحًا",
  "email": "يجب أن يكون هذا الحقل عنوان بريد إلكتروني صالح",

  "min": "يجب أن يكون هذا الحقل @min أو أكثر",
  "max": "يجب أن يكون هذا الحقل @max أو أقل",

  "minlen": "يجب أن يحتوي هذا الحقل على @minlen أحرف أو أكثر",
  "maxlen": "يجب أن يحتوي هذا الحقل على @maxlen أحرف أو أقل",

  "new_password": {
    "minlen": "يجب أن تحتوي كلمة المرور الجديدة على @minlen أحرف أو أكثر",
    "maxlen": "يجب أن تحتوي كلمة المرور الجديدة على @maxlen أحرف أو أقل"
  },

  "confirmation_password": "تأكيد كلمة المرور غير متطابق",

  "phone": {
    "tel": "يجب أن يكون هذا الحقل رقم هاتف دولي صالح",
    "whatsapp": "يجب أن يكون هذا الحقل رقم واتساب دولي صالح",
  },

  "url": {
    "valid": "يجب أن يكون هذا الحقل عنوان URL صالح",
    "protocol": "يجب أن يبدأ هذا الحقل بـ http:// أو https://",
  },

  "twitter_url": "يجب أن يكون هذا الحقل عنوان URL صالح لتويتر، انتقل إلى صفحتك على تويتر وانسخ العنوان الكامل من هناك",
  "facebook_url": "يجب أن يكون هذا الحقل عنوان URL صالح لفيسبوك، انتقل إلى صفحتك على فيسبوك وانسخ العنوان الكامل من هناك",
  "instagram_url": "يجب أن يكون هذا الحقل عنوان URL صالح لإنستغرام، انتقل إلى صفحتك على إنستغرام وانسخ العنوان الكامل من هناك",
  "youtube_url": "يجب أن يكون هذا الحقل عنوان URL صالح ليوتيوب، انتقل إلى صفحتك على يوتيوب وانسخ العنوان الكامل من هناك",
  "twitch_url": "يجب أن يكون هذا الحقل عنوان URL صالح لتويتش، انتقل إلى صفحتك على تويتش وانسخ العنوان الكامل من هناك",
  "google_play_url": "يجب أن يكون هذا الحقل عنوان URL صالح لجوجل بلاي، انتقل إلى صفحة تطبيقك على جوجل بلاي وانسخ العنوان الكامل من هناك",
  "app_store_url": "يجب أن يكون هذا الحقل عنوان URL صالح لمتجر التطبيقات، انتقل إلى صفحة تطبيقك على متجر التطبيقات وانسخ العنوان الكامل من هناك",
}

export default locale;